// Завдання 1

// Створіть клас "Книга" (Book) з властивостями, такими як "назва", "автор" і "рік видання". 
// Додайте метод до класу Book, який буде виводити повний опис книги наприклад printInfo. 
// Створіть кілька об'єктів цього класу та викличте printInfo для кожного екземпляру.
// В окремому файлі створіть клас "Електронна книга" (EBook), який буде успадковувати властивості та методи класу Book.
// Додайте до класу EBook нову властивість, наприклад, "формат файлу". Сторіть метод printInfo для EBook таким чином щоб друкувалась 
// вся доступна інформація про екземляр EBook (все те саме що і для Book але ще формат файлу). 
// Створіть інстанс (екземпляр) класу EBook та викличте метод printInfo
// Геттери та сеттери: Додайте геттери та сеттери для всіх властивостей класу Book та EBook. 
// В сеттерах необхідно додати валідацію для переданих значень. Використовуйте їх для зміни та отримання значень властивостей.
// Створіть статичний метод в класі Book, який буде приймати масив об'єктів(екземрлярів) книг та повертати найдавнішу книгу за роком видання. 
// Викличте його в коді передавши масив книг (серед них мають бути екземляри обох класів Book та EBook)
// Створіть статичний метод для EBook який буде приймати як аргументи екземпляр класу Book і формат файлу як рядок ****та 
// повертати екземпляр класу EBook

const Book = require('./Book');
const EBook = require('./EBook');

const book1 = new Book("Гарри Поттер и философский камень", "Дж.К. Роулинг", 1997);
const book2 = new Book("Атлант расправил плечи", "Айн Рэнд", 1957);
const eBook1 = new EBook("Автостопом по Галактике", "Дуглас Адамс", 1979, 'PDF');
const eBook2 = new EBook("Граф Монте-Кристо", '	Александр Дюма-отец', 1846, "EBUP");

book1.printInfo();
book2.printInfo();
eBook1.printInfo();
eBook2.printInfo();

const oldBook = Book.getOldestBook([book1, book2, eBook1, eBook2]);

console.log("**********************************************************");

console.log("Найдавніша книга за роком видання: ");
oldBook.printInfo();

console.log("**********************************************************");

const ebookFromBook = EBook.fromBook(book1, "EPUB");
ebookFromBook.printInfo();